package buu.informatics.s59160135.foodcalorie.screens.result

import androidx.lifecycle.ViewModel

class ResultViewModel : ViewModel() {

    val itemsJuice = listOf(
        MyData("น้ำมะตูม", "1 แก้ว", "120 Kcal"),
        MyData("น้ำมะนาว", "1 แก้ว", "100 Kcal่"),
        MyData("น้ำมะพร้าว", "1 แก้ว", "120 Kcal"),
        MyData("น้ำลำใย", "1 แก้ว", "100 Kcal"),
        MyData("น้ำส้มคั้น", "1 แก้ว", "160 Kcal"),
        MyData("น้ำสับปะรด", "1 แก้ว", "125 Kcal"),
        MyData("น้ำองุ่น", "1 แก้ว", "112 Kcal"),
        MyData("น้ำอ้อย", "1 แก้ว", "240 Kcal"),
        MyData("น้ำมะเขือเทศ", "1 แก้ว", "48 Kcal"),
        MyData("น้ำกระเจี๊ยบ", "1 แก้ว", "120 Kcal"),
        MyData("น้ำนมข้าวโพด", "1 แก้ว", "80 Kcal"),
        MyData("น้ำผลไม้รวม", "1 กล่อง", "100 Kcal"),
        MyData("น้ำผักรวม", "1 กล่อง", "90 Kcal"),
        MyData("น้ำฝรั่ง", "1 กล่อง", "100 Kcal")
    )

    val itemsCoffee = listOf(
        MyData("กาแฟเย็น", "1 แก้ว", "317 kcal"),
        MyData("โกโก้เย็น", "1 แก้ว", "334 kca"),
        MyData("ชาเขียว(นม)เย็น", "1 แก้ว", "319 kcal"),
        MyData("ชานมเย็น", "1 แก้ว", "319 kcal"),
        MyData("นมเย็น	", "1 แก้ว", "425 kcal"),
        MyData("โอเลี้ยง", "1 แก้ว", "103 kcal"),
        MyData("ชาเย็นหรือชามะนาว", "1 แก้ว", "100 kcal")
    )

    val itemsAlcohol = listOf(
        MyData("เบียร์กระป๋อง", "1 แก้ว", "148 kcal"),
        MyData("ไวน์แดง ", "1 แก้ว", "80 kcal"),
        MyData("สาเกญี่ปุ่น", "1 แก้ว", "105 kcal"),
        MyData("เเชมเปญ", "1 แก้ว", "80 kcal"),
        MyData("วิสกี้", "1 แก้ว", "65 kcal"),
        MyData("วอดก้า", "1 แก้ว", "90 kcal"),
        MyData("เตกีล่า", "1 แก้ว", "100 kcal"),
        MyData("มาร์ตินี่", "1 แก้ว", "161 kcal")
    )

    val itemsSoda = listOf(
        MyData("โค้ก", "1 ขวดเล็ก", "174 kcal"),
        MyData("โค้ก", "1 กระป๋อง", "240 kcal"),
        MyData("เอส", "1 กระป๋อง", "90 kcal"),
        MyData("น้ำแดง", "1 ขวดเล็ก", "112 kcal"),
        MyData("น้ำเขียว", "1 ขวดเล็ก", "109 kcal"),
        MyData("น้ำส้ม", "1 ขวดเล็ก", "120 kcal"),
        MyData("น้ำองุ่น", "1 ขวดเล็ก", "108 kcal")
    )


    val itemsStir = listOf(
        MyData("ข้าวผัดกะเพราหมูกรอบ", "1 จาน", "650 Kcal"),
        MyData("ข้าวผัดกะเพรากุ้ง", "1 จาน", "540 Kcal"),
        MyData("ข้าวผัดกะเพราไก่", "1 จาน", "554 Kcal"),
        MyData("ข้าวผัดกะเพราไก่ไข่ดาว", "1 จาน", "630 Kcal"),
        MyData("ข้าวผัดกะเพราหมู", "1 จาน", "580 Kcal"),
        MyData("ข้าวผัดกุ้งใส่ไข่", "1 จาน", "595 Kcal"),
        MyData("ข้าวผัดกุนเชียง", "1 จาน", "590 Kcal"),
        MyData("ข้าวผัดแกงเขียวหวานไก่", "1 จาน", "630 Kcal"),
        MyData("ข้าวผัดคะน้าหมูกรอบ", "1 จาน", "670 Kcal"),
        MyData("ข้าวผัดต้มยำทะเลแห้ง", "1 จาน", "400 Kcal"),
        MyData("ข้าวผัดน้ำพริกกุ้งสด", "1 จาน", "460 Kcal"),
        MyData("ข้าวผัดน้ำพริกเผาหมู", "1 จาน", "665 Kcal"),
        MyData("ข้าวผัดน้ำพริกลงเรือ", "1 จาน", "605 Kcal"),
        MyData("ข้าวผัดปลาเค็ม", "1 จาน", "405 Kcal"),
        MyData("ข้าวผัดปลาหมึกน้ำพริกเผา", "1 จาน", "535 Kcal"),
        MyData("ข้าวผัดปูใส่ไข่", "1 จาน", "610 Kcal"),
        MyData("ข้าวผัดผักกระเฉดหมูกรอบ", "1 จาน", "600 Kcal"),
        MyData("ข้าวผัดมันกุ้งใส่ไข่", "1 จาน", "575 Kcal"),
        MyData("ข้าวผัดรวมมิตร", "1 จาน", "210 Kcal"),
        MyData("ข้าวผัดสับปะรด", "1 จาน", "335 Kcal"),
        MyData("ข้าวผัดไส้กรอก", "1 จาน", "520 Kcal"),
        MyData("ข้าวผัดหมูน้ำพริกเผา", "1 จาน", "665 Kcal"),
        MyData("ข้าวผัดหมูใส่ไข่", "1 จาน", "557 Kcal"),
        MyData("ข้าวผัดแหนม", "1 จาน", "610 Kcal"),
        MyData("ข้าวผัดอเมริกัน", "1 จาน", "790 Kcal")
    )

    val itemsSimmer = listOf(
        MyData("แกงกะหรี่ไก่", "1 ถ้วย", "450 Kcal"),
        MyData("แกงกะหรี่หมู", "1 ถ้วย", "325 Kcal"),
        MyData("แกงขี้เหล็ก", "1 ถ้วย", "195 Kcal"),
        MyData("แกงขี้เหล็กหมูย่าง", "1 ถ้วย", "245 Kcal"),
        MyData("แกงเขียวหวานไก่", "1 ถ้วย", "240 Kcal"),
        MyData("แกงเขียวหวานปลาดุก", "1 ถ้วย", "235 Kcal"),
        MyData("แกงเขียวหวานลูกชิ้นปลากราย", "1 ถ้วย", "240 Kcal"),
        MyData("แกงเขียวหวานหมู", "1 ถ้วย", "235 Kcal"),
        MyData("แกงจืดไข่เจียว", "1 ถ้วย", "120 Kcal"),
        MyData("แกงจืดตำลึงหมูสับ", "1 ถ้วย", "90 Kcal"),
        MyData("แกงจืดเต้าหู้ไม่ใส่หมูสับ", "1 ถ้วย", "80 Kcal"),
        MyData("แกงจืดเต้าหู้ยัดไส้", "1 ถ้วย", "110 Kcal"),
        MyData("แกงจืดถั่วงอกไม่ใส่หมูสับ", "1 ถ้วย", "50 Kcal"),
        MyData("แกงจืดถั่วงอกหมูสับ", "1 ถ้วย", "50 Kcal"),
        MyData("แกงจืดฟักยัดไส้", "1 ถ้วย", "90 Kcal"),
        MyData("แกงจืดมะระยัดไส้", "1 ถ้วย", "90 Kcal"),
        MyData("แกงจืดมะระยัดไส้หมูวุ้นเส้น", "1 ชิ้น", "66 Kcal"),
        MyData("แกงจืดวุ้นเส้น", "1 ถ้วย", "85 Kcal"),
        MyData("แกงไตปลา", "1 ถ้วย", "50 Kcal ี่"),
        MyData("แกงป่าไก่", "1 ถ้วย", "110 Kcal"),
        MyData("แกงเผ็ดไก่ใส่มะเขือ", "1 ถ้วย", "235 Kcal"),
        MyData("แกงเผ็ดไก่ใส่หน่อไม้", "1 ถ้วย", "245 Kcal"),
        MyData("แกงเผ็ดเป็ดย่าง", "1 ถ้วย", "240 Kcal"),
        MyData("แกงเผ็ดฟักทองใส่หมู", "1 ถ้วย", "250 Kcal"),
        MyData("แกงเผ็ดฟักทองหมู", " 1 ถ้วย", "250 Kcal"),
        MyData("แกงเผ็ดมะเขือไก่", "1 ถ้วย", "235 Kcal"),
        MyData("แกงเผ็ดลูกชิ้นปลา", " 1 ถ้วย", " 240 Kcal"),
        MyData("แกงเผ็ดหน่อไม้ไก่", "1 ถ้วย", "245 Kcal"),
        MyData("แกงเผ็ดหมูยอดมะพร้าว", "1 ถ้วย", "245 Kcal"),
        MyData("แกงมัสมั่นไก่", "1 ถ้วย", "325 กิโลแคลอรี่"),
        MyData("แกงเลียง", "1 ชาม", "115 Kcal"),
        MyData("แกงเลียงผักรวม", "1 ถ้วย", "48 Kcal"),
        MyData("แกงส้ม", "1 ถ้วย", "28 Kcal"),
        MyData("แกงส้มชะอมไข่ทอดใส่กุ้ง", "1 ถ้วย", "270 Kcal"),
        MyData("แกงส้มดอกแคกุ้ง", "1 ถ้วย", "105 Kcal"),
        MyData("แกงส้มปลาช่อนผักบุ้ง", "1 ถ้วย", "105 Kcal"),
        MyData("แกงส้มปลาแป๊ะซะ", "1 ถ้วย", "160 Kcal"),
        MyData("แกงส้มผักกระเฉดปลา", "1 ชาม", "110 Kcal"),
        MyData("แกงส้มผักบุ้งปลาช่อน", "1 ถ้วย", "105 Kcal"),
        MyData("แกงส้มผักรวม", "1 ถ้วย", "120 Kcal"),
        MyData("แกงหมูเทโพ", "1 ถ้วย", "300 Kcal"),
        MyData("แกงเหลืองมะละกอกุ้ง", "1 ถ้วย", "80 Kcal"),
        MyData("แกงเหลืองหน่อไม้ดองกับปลา", "1 ถ้วย", "80 Kcal")
    )

    val itemsBoil = listOf(
        MyData("ต้มกะทิสายบัวปลาทูนึ่ง", "1 ถ้วย", "225 Kcal"),
        MyData("ต้มข่าไก่", "1 ถ้วย", "210 Kcal"),
        MyData("ต้มโคล้งไก่ย่าง", "1 ถ้วย", "115 Kcal"),
        MyData("ต้มโคล้งปลากรอบ", "1 ถ้วย", "60 Kcal"),
        MyData("ต้มจับฉ่าย", "1 ถ้วย", "15 Kcal"),
        MyData("ต้มจืดเลือดหมู", "1 ถ้วย", "120 Kcal"),
        MyData("ต้มตือฮวน", "1 ถ้วย", "160 Kcal"),
        MyData("ต้มผักกาดดองซี่โครงหมู", "1 ถ้วย", "90 Kcal"),
        MyData("ต้มยำกุ้ง", "1 ถ้วย", "65 Kcal"),
        MyData("ต้มยำไก่", "1 ถ้วย", "60 Kcal"),
        MyData("ต้มยำไก่ใส่เห็ด", "1 ถ้วย", "80 Kcal"),
        MyData("ต้มยำปลากระป๋อง", "1 ถ้วย", "55 Kcal"),
        MyData("ต้มยำปลากะพง", "1 ถ้วย", "80 Kcal"),
        MyData("ต้มยำปลาทู", "1 ถ้วย", "10 Kcal"),
        MyData("ต้มยำปลาหมึก", "1 ถ้วย", "9 Kcal"),
        MyData("ต้มยำเห็ดสด", "1 ถ้วย", "30 Kcal"),
        MyData("ต้มส้มปลาทู", "1 ถ้วย", "130 Kcal"),
        MyData("ต้มหัวผักกาดขาวซี่โครงหมู", "1 ถ้วย", "90 Kcal")
    )

    val itemsGrill = listOf(
        MyData("ไก่ย่าง", "1 น่อง", "165 Kcal"),
        MyData("คอหมูย่าง", "1 จาน", "200 Kcal"),
        MyData("น่องไก่ย่าง", "1 น่อง", "97 Kcal"),
        MyData("ปลาซาบะย่าง", "1 ตัว", "220 Kcal"),
        MyData("ปลาแซลมอนย่าง", "1 จาน", "260 Kcal"),
        MyData("ปลาหมึกย่าง", "1 ไม้", "37 Kcal"),
        MyData("หมูย่างเกาหลี", "1 ชุด", "375 Kcal"),
        MyData("อกไก่ย่าง", "1 ชิ้น", "110 Kcal")
    )


}

